common/models/User.php

SELECT * FROM `user` WHERE (`u_id`=2) AND (`status`=10)
---
    public static function findIdentity($id)
    {
        return static::findOne(['u_id' => $id, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`username`='himanshu93') AND (`status`=10)
---
    public static function findByUsername($username)
    {
        return static::findOne(['email' => $username, 'status' => self::STATUS_ACTIVE]);

SELECT * FROM `user` WHERE (`password_reset_token`='6Jjv2rjHTnuvhCJu0s0xJeXYijLxwrzC_1445126352') AND (`status`=10)
---
    public static function findByPasswordResetToken($token)
    {
        if (!static::isPasswordResetTokenValid($token)) {
            return null;
        }

        return static::findOne([
            'password_reset_token' => $token,
            'status' => self::STATUS_ACTIVE,
        ]);