backend/models/Admin.php

SELECT * FROM `admin` WHERE `id`=3
---
    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id]);

SELECT * FROM `admin` WHERE `email`='himanshu53939@gmail.com'
---
    public static function findByUsername($username)
    {
        return static::findOne(['email' => $username]);